---
type: ExternalDataInstanceAddingIntoDocumentEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 1
tags: [revit-api, class]
---

# ExternalDataInstanceAddingIntoDocumentEventArgs

`Autodesk.Revit.DB.Events.ExternalDataInstanceAddingIntoDocumentEventArgs` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | TypeId | 2023 | `public ElementId TypeId { get ; }` |